app/Http/Requests/Product/StoreProductRequest.php

SELECT * FROM `settings` WHERE `title` = 'products_fields_required' LIMIT 1
---
    public function rules(Request $request)
    {
        $settingsTitles = Cache::get('settings')->pluck('title')->toArray();
        $productSettings = Cache::get('settings')->whereIn('title',$settingsTitles)->groupBy('title')->toArray();