app/Services/RolesAndPermissionsService.php

    public static function givePermissionToParentRoleAndChildren(array|Permission $permissions , CustomRole $roles) {
        return $roles->allChildren();
        $ids = collect($roles->allChildren()->children)
            ->map(function($item){
                return [$item->id, collect($item->children)->map('getIds')->all()];

            })  // call getIds function which will in turn do the same for all children
            ->flatten()      // flatten the resulting array
            ->sort()         // sort the resulting ids since they probably won't be in order
            ->values()       // only interested in the values, not the keys
            ->all();         // transform collection to array

        return $ids;

        $roles = $roles->allChildren()->children->map(function($item, $key) {

            $children_string = explode('.',RolesAndPermissionsService::generateRelationStringForRoleChildren($item->id));
            $roles_array = array();

            for($i = 0; $i < count($children_string); $i++){

                $children = CustomRole::with("children".str_repeat('.children',$i))->find($item->id);
                if( $children == null || !isset($children) ){
                    continue;
                }
                //there is data, we will enter the cuurent child to the array and do the same to ghe rest of the array uhnvtil we fisnhs all the arrays
                array_push($roles_array , $children);
            }

            return $roles_array;

        });
---
select * from `roles`

    public static function generateRelationStringForRoleChildren(int | Role $role): Array
    {
        $allRoles = CustomRole::all();
---
select * from `roles`