app/Services/RolesAndPermissions/PermissionsServices.php

    public static function getPermissionChildren(int | Permission $permission,$permissionsOfRole = [], $flatten= false) : Array
    {
        // got all the roles
        $allPermissions = CustomPermission::all(); //get all roles info
---
SELECT * FROM `permissions`

    public static function generateChildrenForAllPermissions($allPermissions):Array {
        $permissionChildren = [];
        foreach($allPermissions as $currentPermission){
            // get the parent ID if there is any if not set to 0, so the values of the first index `0` do not have any parents
            $parentId = ($currentPermission->parent_id ?? 0);

            // if the index was not set we just set it.
            if(!isset($permissionChildren[$parentId])){
                $permissionChildren[$parentId] = [];
            }
            // under the given index we add a new value the new child of that index
            $permissionChildren[$parentId][] = CustomPermission::find($currentPermission->id);
---
SELECT * FROM `permissions` WHERE `permissions`.`id` = 1 LIMIT 1