app/Http/Controllers/Brand/BrandController.php

    public function create()
    {
        $fields = Field::with('fieldValue')->whereEntity('brand')->get();
        $labels = Label::whereEntity('brand')->get();
---
SELECT * FROM `fields` WHERE `entity` = 'brand'
SELECT * FROM `labels` WHERE `entity` = 'brand'