app/Http/Controllers/Settings/SettingsController.php

    public function index(Request $request)
    {

        if ($request->method()=='POST') {
            $searchKeys=['title','value','is_developer'];
            // return $this->getSearchPaginated(SettingsResource::class, Setting::class,$request, $searchKeys);
            $data=$request->data;
            $keys = array_keys($data);
            $rows = Setting::where(function($query) use($keys,$data,$searchKeys){
                    foreach($keys as $key){
                        if(in_array($key,$searchKeys)){
                            $value=strtolower($data[$key]);

                            $query->whereRaw('lower('.$key.') like (?)',["%$value%"]);
                        }
                        else{
                            throw new Exception();
                        }
                    }
                    })->paginate($request->limit ?? config('defaults.default_pagination'));
---
SELECT * FROM `settings` LIMIT 15 offset 0
SELECT count(*) as aggregate FROM `settings`