app/Http/Controllers/Country/CountryController.php

    public function store(StoreCountryRequest $request)
    {

        $country = new Country();
        $country->name = json_encode($request->name);
        $country->iso_code_1 = $request->iso_code_1;
        $country->iso_code_2 = $request->iso_code_2;
        $country->phone_code = $request->phone_code;
        $country->flag = $request->flag;
        if($request->flag){
            $country->flag= $this->imageUpload($request->file('flag'),config('image_paths.country.images'));
        }
        if(!$country->save())
---
INSERT INTO `countries` (`name`, `iso_code_1`, `iso_code_2`, `phone_code`, `flag`, `updated_at`, `created_at`) VALUES ('{\\"en\\":\\"\\\\\\"{\\\\\\\\\\\\\\"en\\\\\\\\\\\\\\":\\\\\\\\\\\\\\"United states\\\\\\\\\\\\\\",\\\\\\\\\\\\\\"ar\\\\\\\\\\\\\\":\\\\\\\\\\\\\\"\\\\\\\\u0627\\\\\\\\u0644\\\\\\\\u0648\\\\\\\\u0644\\\\\\\\u0627\\\\\\\\u064a\\\\\\\\u0627\\\\\\\\u062a \\\\\\\\u0627\\\\\\\\u0644\\\\\\\\u0645\\\\\\\\u062a\\\\\\\\u062d\\\\\\\\u062f\\\\\\\\u0629\\\\\\\\\\\\\\"}\\\\\\"\\"}', '123', '123', '+1', '62a860820fe6b_User by lightlanaskywalker on DeviantArt.jpg', '2022-06-14 10:18:42', '2022-06-14 10:18:42')