app/Http/Controllers/Product/ProductController.php

SELECT * FROM `currencies` WHERE `currencies`.`id` in (1)
SELECT * FROM `prices` WHERE `is_virtual` = 0
---
    public function create()
    {
        $PriceArray=[];
        $prices=Price::with('currency')->where('is_virtual', 0)->get();

INSERT INTO `products` (`name`, `slug`, `code`, `sku`, `type`, `quantity`, `reserved_quantity`, `minimum_quantity`, `summary`, `specification`, `meta_title`, `meta_description`, `meta_keyword`, `description`, `status`, `barcode`, `height`, `width`, `is_disabled`, `length`, `weight`, `is_default_child`, `parent_product_id`, `category_id`, `unit_id`, `brand_id`, `tax_id`, `products_statuses_id`, `updated_at`, `created_at`) VALUES ('{\\"en\\":\\"{\\\\\\"en\\\\\\":\\\\\\"Head and Shoulders\\\\\\"}\\"}', 'ss1', 'ss1', 'bilal', 'variable', 0, 0, 0, '{\\"en\\":\\"{\\\\\\"en\\\\\\":\\\\\\"text\\\\\\"}\\"}', '{\\"en\\":\\"{\\\\\\"en\\\\\\":\\\\\\"text\\\\\\"}\\"}', '{\\"en\\":\\"{\\\\\\"en\\\\\\":\\\\\\"text\\\\\\"}\\"}', '{\\"en\\":\\"{\\\\\\"en\\\\\\":\\\\\\"text\\\\\\"}\\"}', '{\\"en\\":\\"text\\"}', '{\\"en\\":\\"{\\\\\\"en\\\\\\":\\\\\\"text\\\\\\"}\\"}', 'published', 21417853179, , , 0, , , 0, , 1, 1, , , 1, '2022-07-14 08:10:33', '2022-07-14 08:10:33')
---
            $product->brand_id = $request->brand_id;
            $product->tax_id = $request->tax_id;
            $product->products_statuses_id = $request->products_statuses_id;
            $product->save();