app/Http/Controllers/Tax/TaxController.php

INSERT INTO `taxes` (`name`, `is_complex`, `percentage`, `complex_behavior`, `updated_at`, `created_at`) VALUES ('{\\"en\\":\\"{\\\\\\"en\\\\\\":\\\\\\"tax3\\\\\\"}\\"}', 0, 1, , '2022-06-24 07:48:36', '2022-06-24 07:48:36')
INSERT INTO `taxes` (`name`, `is_complex`, `percentage`, `complex_behavior`, `updated_at`, `created_at`) VALUES ('{\\"en\\":\\"{\\\\\\"en\\\\\\":\\\\\\"tax4\\\\\\"}\\"}', 0, 15, , '2022-06-23 12:37:36', '2022-06-23 12:37:36')
---
    public function store(StoreTaxRequest $request)
    {

    $tax=new Tax();
    $tax->name = json_encode($request->name);
    $tax->is_complex = $request->is_complex;
    if($request->is_complex){
        $tax->percentage = 0;
    }else{
        $tax->percentage = $request->percentage;
    }
    $tax->complex_behavior = $request->complex_behavior;

    $check=true;

    if(!$tax->save())
        return $this->errorResponse(['message' => __('messages.failed.create',['name' => __(self::OBJECT_NAME)]) ]);

    if($request->is_complex && $request->components){
        $componentsArray=$request->components;
        foreach ($request->components as $component => $value)
            $componentsArray[$component]["tax_id"] = $tax->id;

        $check = TaxComponent::insert($componentsArray);