app/Http/Controllers/Category/CategoryController.php

    public function create()
    {
        $fields = Field::with('fieldValue')->whereEntity('category')->get();
        $labels = Label::whereEntity('brand')->get();
        $parentCategories = Category::all();
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1)
SELECT `fields`.*, `categories_fields`.`category_id` as `pivot_category_id`, `categories_fields`.`field_id` as `pivot_field_id` FROM `fields` inner join `categories_fields` on `fields`.`id` = `categories_fields`.`field_id` WHERE `categories_fields`.`category_id` in (2)
SELECT * FROM `categories` WHERE `categories`.`parent_id` in (2)