app/Http/Controllers/Discount/DiscountController.php

    public function index(Request $request)
    {

        if ($request->method()=='POST') {
            return $this->getSearchPaginated(DiscountResource::class,Discount::class,$request->data[0],$request->limit);
---
SELECT * FROM `discounts` WHERE (lower(name) like ('%bb%')) LIMIT 15 offset 0
SELECT count(*) as aggregate FROM `discounts` WHERE (lower(name) like ('%bb%'))