app/Http/Controllers/Discount/DiscountController.php

    public function store(StoreDiscountRequest $request)
    {
        DB::beginTransaction();

        try {

            $discount = new Discount();
            $discount->name = json_encode($request->name);
            $discount->start_date = $request->start_date;
            $discount->end_date = $request->end_date;
            $discount->discount_percentage = $request->discount_percentage;

//            $discount->save();
            $tagsProducts =  DiscountsServices::extractProductsFromMultiArray( Tag::findMany($request->tag)->load('products')->pluck('products')->toArray() );
            $brandsProducts =DiscountsServices::extractProductsFromMultiArray( Brand::findMany($request->brand)->load('products')->pluck('products')->toArray() );

            $categorySingleProducts = DiscountsServices::extractProductsFromMultiArray( Category::findMany($request->category)->load('multipleProducts')->pluck('products')->toArray() );
---
SELECT * FROM `tags` WHERE `tags`.`id` in (1, 2)
SELECT `products`.*, `products_tags`.`product_id` as `pivot_product_id`, `products_tags`.`tag_id` as `pivot_tag_id` FROM `products` inner join `products_tags` on `products`.`id` = `products_tags`.`tag_id` WHERE `products_tags`.`product_id` in (1, 2)
SELECT * FROM `brands` WHERE `brands`.`id` in (1, 2)
SELECT * FROM `products` WHERE `products`.`brand_id` in (1, 2)
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2)
SELECT * FROM `products` WHERE `products`.`category_id` in (1, 2)