app/Http/Controllers/Users/UsersController.php

    public function index(Request $request){

        if ($request->method()=='POST') {
            $data=$request->data ?? [];
            $roleName = $request->data['role_name'] ?? '';
            $keys = array_keys($data ?? []);
            $searchKey = ['first_name','last_name','email','username'];
            $user=User::with(['roles' => fn($query) => $query->select('name')])
                ->whereHas('roles',fn ($query) => $query->whereRaw('lower(name) like (?)',["%$roleName%"]))
                ->where(function($query) use($data,$keys,$searchKey){
                        foreach($keys as $key) if(in_array($key,$searchKey))
                            $query->where($key,'LIKE', '%'.$data[$key].'%');
                })
                ->paginate($request->limit ?? config('defaults.default_pagination'));
---
SELECT count(*) as aggregate FROM `users` WHERE (`username` LIKE '%us%')

    public function store(StoreUserRequest $request){

        DB::beginTransaction();

        try {
            $user = User::create([
                'username' => $request->username,
                'email' => $request->email,
                'first_name' => $request->first_name,
                'last_name' => $request->last_name,
                'salt' => $request->salt ?? '',
                'password' => Hash::make($request->password),
            ]);
---
SELECT * FROM `users` WHERE (`username` LIKE '%us%') LIMIT 10 offset 0

    public function destroy(User $user)
    {
        if(!$user->delete())
---
DELETE FROM `users` WHERE `id` = 9