app/Http/Controllers/Language/LanguageController.php

SELECT * FROM `languages` WHERE `code` = 'en' LIMIT 1
---
    public function setLanguage($locale){

        $language=Language::where('code',$locale)->first();