app/Http/Controllers/RolesController.php

    public function index()
    {
        return response()->json(['data' => [
            'roles' =>RolesResource::collection(CustomRole::all()),
            ]
        ],202);
---
select * from `roles`

    public function update(StoreRoleRequest $request, CustomRole $role)

    {
        DB::beginTransaction();

        try {
            $role->update(['name' => $request->name]);
---
update `roles` set `name` = 'reader 2', `roles`.`updated_at` = '2022-05-10 06:44:05' where `id` = 1