app/Http/Controllers/TestController.php

    public function getToken(){
        return User::first()->createToken('my-token');
---
SELECT * FROM `users` LIMIT 1

    public function test(){
        dd(\auth()->user());
        return ( \auth()->check());
        $currency = Currency::find(3)->setIsDefault()->save();
---
SELECT * FROM `currencies` WHERE `currencies`.`id` = 3 LIMIT 1