app/Models/CustomRole.php

    public function setParent(Role | int $parent){

        if(is_object($parent)){

            if($parent->id = $this->id){
                return false;
            }

            $this->parent_id = $parent->id;
            if($this->save()){
                return $this;
            }
            return false;
        }

        if(!$this->find($parent) || $this->id == $parent){
            return false;
        }

        $this->parent_id = $parent;
        if($this->save()){
---
select * from `roles` where `roles`.`id` in (2, 5, 3, 4, 12)
update `roles` set `parent_id` = '', `roles`.`updated_at` = '2022-05-09 09:08:00' where `id` = 1

    public function allChildren(){
        $old_count = 0;
        $relations = "children";
        $current_count = collect($this->load($relations))->flatten()->count();

        while($current_count > $old_count){
            $old_count = collect($this->load($relations))->flatten()->count();
            $relations .= ".children";
            $current_count = collect($this->load($relations))->flatten()->count();
        }

        return $this->load($relations);
---
select * from `roles` where `roles`.`id` in (2, 5, 3, 4, 12)